from settings import Model
from settings import GameLose
from settings import GameOver
game = Model()
lose = GameLose()
over = GameOver()
start = input('Це гра "Чарівник, Рицар, Злодій". Яущо бажаєте грати (Натисніть + або -): ')

if start == '+':
    print('Завантаження...')
    print("Правила гри, ви обираєте персонажа і по черзі отакуєте та захищяєтесь, якщо атака була успішна , вам зараховується бал,\n"
          "у вашого противника знімається 1 одиниця здоров'я , при успішному захисті ви зберігаєте свій рівень здоров'я,\n"
          "якщо захист був провальний відіймяється 1 одиниця здоров'я. Чарівник перемогає Рицаря, Рицарь перемогає Злодія,\nЗлодій перемагає Чарівника Гарної гри!")
    print('Якщо бажаєте дізнатись свій рахунок "с".')
    print("Завантаження завершено!")
    while True:
        try:
            game.play()
        except GameOver:
            print('ВИ ВИЙГРАЛИ!!!\nКількість набраних балів',game.user_ball ,'Рівень переможеного ворога',game.rand_level)
            break
        except GameLose:
            print('Ви програли.\nКількість набраних балів - ',game.user_ball ,'. Рівень ворога -',game.rand_level)
        break
if start == '-':
    print('Допобачення.')
elif start != '+' or '-':
    print('Якщо бажаєте грати перезапустіть програму та натисніть "+".')